Repository: IT-FAMCS/impoexpo
Catalog: packages/impoexpo-client/src/locales/*.po
Languages: ru

source: failed to connect to the server via SSE
ru: не удалось подключиться к серверу через SSE

source: transfer was cancelled
ru: перенос был отменён

source: something is up with the server
ru: что-то не так с сервером

source: failed to upload project files
ru: не удалось загрузить файлы проекта

source: failed to upload the project
ru: не удалось загрузить проект

source: transfer
ru: перенос

source: documentation
ru: документация

source: legal
ru: политика

source: drag and drop a file here or click
ru: перетащите файл сюда или нажмите

source: will accept: {0}
ru: разрешённые форматы: {0}

source: projects
ru: проекты

source: you currently have no saved projects.<0/>go create one!
ru: на данный момент у вас нет сохранённых проектов.<0/>пойдите создайте!

source: preparing
ru: готовимся

source: uploading the project
ru: загружаем проект

source: uploading project files
ru: выкладываем файлы проекта

source: connecting to the server
ru: подключаемся к серверу

source: transferring
ru: переносим

source: reconnecting to the server
ru: пробуем переподключиться к серверу

source: done!
ru: готово!

source: an error occurred
ru: произошла ошибка

source: edit project
ru: редактировать проект

source: delete project
ru: удалить проект

source: run project
ru: запустить проект (перенос)

source: yes
ru: да

source: no
ru: нет

source: are you sure?
ru: вы уверены?

source: this transfer produced no files
ru: этот перенос не выдал файлов

source: notifications
ru: уведомления

source: settings
ru: настройки

source: general
ru: общие

source: language
ru: язык

source: theme
ru: тема

source: editor options
ru: настройки редактора

source: show a "what does it do?" button near nodes
ru: показывать кнопку "что это делает?" возле узлов

source: will open the documentation for the selected node
ru: по нажатию открывает документацию выбранного узла

source: developer options
ru: для разработчиков

source: allow taking screenshots of nodes
ru: показывать опцию для скриншота узлов

source: used for writing documentation
ru: обычно используется для написания документации

source: the data is stale?
ru: данные не обновляются?

source: why doesn't the data refresh?
ru: почему данные не обновляются?

source: in order to avoid overwhelming the server, we cache some resource-intensive requests (i.e. anything related to integrations).<0/>if you're <1>absolutely sure</1> that you've updated the data, click the button bellow.
ru: чтобы не перегрузить сервер, мы кэшируем некоторые ресурсоёмкие запросы (например, всё что связано с интеграциями).<0/>если вы <1>абсолютно уверены</1>, что обновили данные, нажмите на кнопку ниже.

source: please note that the amount of times you can perform this request is <0>limited</0>.<1/>if you'll do it too often, the server will give you a timeout.
ru: обратите внимание, что количество возможных запросов <0>ограничено</0>.<1/>если вы будете делать это слишком часто, сервер выдаст вам таймаут.

source: close
ru: закрыть

source: refresh
ru: обновить

source: you're sending requests too often!<0/>you can try again in:
ru: вы слишком часто отправляете запросы!<0/>попробуйте снова через:

source: retry
ru: попробовать снова

source: this node is an iterator.
ru: этот узел — итератор.

source: save project...
ru: сохранить проект...

source: successfully saved the project
ru: проект успешно сохранён

source: failed to save the project (did you mess with the database?)
ru: не удалось сохранить проект (вы трогали базу данных?)

source: save project as...
ru: сохранить проект как...

source: layout nodes
ru: упорядочить узлы

source: export project...
ru: экспортировать проект...

source: undo
ru: отменить

source: redo
ru: повторить

source: done
ru: далее

source: failed to render node
ru: не удалось зарендерить узел

source: ok
ru: ок

source: duplicate
ru: дублировать

source: this node cannot be removed as it's not searchable and is tied to an integration.
ru: этот узел не может быть удалён, т.к. он привязан к интеграции и не может быть найден через диалог поиска.

source: delete
ru: удалить

source: render to clipboard
ru: зарендерить в буфер обмена

source: render to file
ru: зарендерить в файл

source: export project
ru: экспорт проекта

source: are you sure you want to export this project?
ru: вы уверены, что хотите экспортировать этот проект?

source: please note that <0>all integration-related information will not be exported.</0> this means that, when importing the project, you'll have to reattach all integration nodes again.
ru: пожалуйста, учтите, что <0>вся информация, связанная с интеграциями, не будет экспортирована.</0> при импорте проекта вам придётся переподсоединить все узлы из интеграций.

source: cancel
ru: отмена

source: export
ru: экспортировать

source: save project
ru: сохранить проект

source: project name
ru: название проекта

source: group (optional)
ru: группа (по желанию)

source: save
ru: сохранить

source: enter the name, category or tag of the needed node...
ru: введите название, категорию или тег нужного узла...

source: go back
ru: вернуться назад

source: the results are filtered based on what node and property you've selected.
ru: результаты отфильтрованы на основании выбранных вами узла и его свойства.

source: array
ru: массив

source: length of array
ru: размер массива

source: size of array
ru: длина массива

source: length
ru: размер

source: iterate over elements of the array...
ru: пройтись по каждому элементу массива...

source: for each item in the array, foreach
ru: для каждого элемента в массива, для каждого

source: object
ru: объект

source: is this the first iteration?
ru: это первая итерация?

source: is first entry, is first object
ru: первый объект, первый элемент

source: must be connected to an iterator node. otherwise, will always return false.
ru: должен быть присоединён к узлу-итератору. в противном случае будет всегда возвращать "ложь".

source: first iteration?
ru: первая итерация?

source: is this the last iteration?
ru: это последняя итерация?

source: is last entry, is last object
ru: последний объект, последний элемент

source: last iteration?
ru: последняя итерация?

source: conditional
ru: условия

source: if...
ru: если...

source: condition
ru: условие

source: value when true
ru: значение когда "истина"

source: value when false
ru: значение когда "ложь"

source: value
ru: значение

source: repeat X times...
ru: повторить X раз...

source: amount of times
ru: кол-во раз

source: iteration
ru: итерация

source: starting from 1
ru: начиная с 1

source: throw error if null
ru: выдать ошибку если null

source: nullable object
ru: nullable объект

source: error message
ru: сообщение об ошибке

source: skip iteration, if...
ru: пропустить итерацию, если...

source: skip, ignore
ru: пропустить, игнорировать

source: must be connected to an iterator node, otherwise will never skip an iteration.
ru: должно быть подключено к узлу-итератору, иначе никогда не пропустит итерацию.

source: same object
ru: тот же объект

source: date & time
ru: дата и время

source: set locale
ru: задать локаль

source: change country, change locale
ru: изменить язык, изменить страну

source: date
ru: дата

source: locale
ru: локаль

source: result
ru: результат

source: set time zone
ru: задать часовой пояс

source: shift date, shift time, change time zone
ru: сместить дату, сместить время, изменить часовой пояс

source: time zone
ru: часовой пояс

source: date -> string (preset)
ru: дата -> строка (по встроенному шаблону)

source: convert date to string, format date to string
ru: превратить дату в строку, форматировать дату

source: preset
ru: шаблон

source: current date
ru: текущая дата

source: now, current time
ru: сейчас, текущее время

source: only use this node to get the current date, not the precise time!
ru: используйте этот узел только для даты, а не точного времени!

source: group by date
ru: группировать по дате

source: group by time
ru: группировать по времени

source: sorting method
ru: метод сортировки

source: in ascending order (from earliest to latest)
ru: в возрастающем порядке (от самой ранней к самой поздней)

source: in descending order (from latest to earliest)
ru: в убывающем порядке (от самой поздней к самой ранней)

source: key
ru: ключ

source: is the date within a certain range?
ru: находится ли дата в диапазоне?

source: check date, verify date, date boundaries, is date before, is date after
ru: проверить дату, границы даты, дата до, дата после

source: start
ru: начало

source: the earliest allowed date
ru: самая ранняя допустимая дата

source: end
ru: конец

source: the latest allowed date
ru: самая поздняя допустимая дата

source: dates are compared including the start and end days!
ru: даты сравниваются включая начальные и конечные дни!

source: literals
ru: литералы

source: number
ru: число

source: string
ru: строка

source: boolean
ru: флаг

source: math
ru: математика

source: add
ru: сложить

source: sum
ru: сумма

source: subtract
ru: вычесть

source: multiply
ru: умножить

source: divide
ru: делить

source: modulo
ru: остаток от деления

source: remainder
ru: деление с остатком

source: power
ru: возвести в степень

source: absolute value
ru: модуль

source: log
ru: логарифм

source: negate
ru: отрицание

source: square root
ru: квадратный корень

source: is this number an integer?
ru: является ли число целым?

source: is number whole, no decimal part
ru: число натуральное, без части после запятой

source: information
ru: информация

source: message
ru: сообщение

source: warning
ru: предупреждение

source: error
ru: ошибка

source: operators
ru: операторы

source: equal
ru: равно...

source: same
ru: одинаковы

source: and
ru: и...

source: or
ru: или...

source: not
ru: не...

source: negate, !
ru: отрицание, !

source: less than
ru: меньше чем...

source: <, smaller
ru: <, строго меньше

source: less or equal to
ru: меньше или равно...

source: greater than
ru: больше чем...

source: >, larger
ru: >, строго больше

source: greater or equal to
ru: больше или равно...

source: strings
ru: строки

source: replace in string
ru: заменить в строке

source: pattern
ru: образец

source: replacement
ru: замена

source: string contains X?
ru: строка содержит X?

source: search in string, find in string
ru: найти в строке, поиск в строке

source: length of string
ru: длина строки

source: join strings
ru: объединить строки

source: combine strings, add strings
ru: добавить строки, сложить строки, добавить строки

source: delimiter (optional)
ru: разделитель (необязательно)

source: format string
ru: заполнить строку по шаблону

source: template string
ru: отформатировать строку, шаблон строки

source: template
ru: шаблон

source: to create a placeholder, use '{NUMBER}', where NUMBER starts from 0.
ru: чтобы создать заполнитель, используйте '{ЧИСЛО}', где ЧИСЛО начинается с 0.

source: hi, '{0}'!
ru: привет, '{0}'!

source: arguments
ru: аргументы

source: the order in which nodes are connected matters here!
ru: порядок, в котором присоединяются узлы, здесь очень важен!

source: number -> string
ru: число -> строка

source: string -> number
ru: строка -> число

source: split string
ru: разбить строку

source: divide string, explode string
ru: разделить строку, поделить строку на части

source: delimiter
ru: разделитель

source: parts
ru: части

source: trim string
ru: обрезать строку

source: cut string, remove spaces
ru: удалить пробелы в строке, убрать пробелы

source: trim start?
ru: обрезать начало?

source: trim end?
ru: обрезать конец?

source: input
ru: ввод

source: where shall we start?
ru: с чего начнём?

source: anything else?
ru: что-нибудь ещё?

source: what's the read source?
ru: откуда будем читать?

source: what's the write source?
ru: куда будем писать?

source: failed to import the project template
ru: не удалось импортировать шаблон проекта

source: create an empty project
ru: создать пустой проект

source: import an existing project
ru: импортировать существующий проект

source: not outputting anything?
ru: ничего не выводим?

source: add another
ru: добавить ещё

source: next
ru: далее

source: failed to check integration authentication status
ru: не удалось проверить статус авторизации интеграции

source: download
ru: скачать

source: you were not supposed to see this.
ru: вы не должны были это увидеть.

source: view all files
ru: посмотреть все файлы

source: try again
ru: попробовать снова

source: return to the homepage
ru: на главную страницу

source: notifications will appear here<0/>(if there are any)
ru: уведомления появятся тут<0/>(если они есть)

source: not all permissions have been provided!
ru: не все права были предоставлены!

source: exchanging tokens with the server
ru: обмениваемся токенами с сервером

source: couldn't exchange tokens with the server (check the console)
ru: не удалось обменяться токенами с сервером (проверьте консоль)

source: waiting for the login flow response
ru: ожидаем результат входа

source: to continue, login with your google account.
ru: чтобы продолжить, войдите через свой google аккаунт.

source: login via google
ru: войти через гугл

source: an error occurred during login:
ru: во время входа произошла ошибка:

source: is this you?
ru: всё верно?

source: relogin
ru: перезайти

source: receiving the form's layout
ru: получаем макет формы

source: failed to receive the form's layout (and create a node for it)
ru: не удалось получить макет формы (и создать для неё узел)

source: back to form selection
ru: назад к выбору формы

source: checking read permissions for the form
ru: проверяем наличие прав на чтение формы

source: couldn't verify read permissions for the form (or their lack of)
ru: не удалось проверить наличие прав на чтение формы (или их нет)

source: receiving a list of your forms
ru: получаем список ваших форм

source: couldn't receive a list of your forms
ru: не удалось получить список ваших форм

source: select a form:
ru: выберите форму:

source: you have already selected all forms!<0/>if you've created a new form, or got access to one, click the button below.
ru: вы уже выбрали все формы!<0/>если вы создали новую форму, или получили доступ к форме, нажмите на кнопку ниже.

source: back to source selection
ru: назад к выбору источника

source: no placeholder were found in the document.<0/>please check the document and try uploading it again.
ru: в документе не были найдены заполнители.<0/>пожалуйста, проверьте документ и попробуйте снова.

source: go back to file upload
ru: вернуться к загрузке файла

source: the following placeholders were found:
ru: были найдены следующие заполнители:

source: is everything correct?
ru: всё верно?

source: no, go back to file upload
ru: нет, вернуться к загрузке файла

source: yes, proceed
ru: да, продолжить

source: extracting placeholders from the document
ru: извлекаем заполнители из документа

source: couldn't extract placeholders from the document
ru: не удалось извлечь заполнители из документа

source: back to file upload
ru: вернуться к загрузке файла

source: text
ru: текст

source: list
ru: список

source: items
ru: элементы

source: automatically separate list items
ru: автоматически разделять элементы списка

source: automatically add a semicolon (;) to every list item except for the last one, which will have a dot (.) added instead.
ru: автоматически добавлять точку с запятой (;) к концу каждого элемента списка, кроме последнего, к которому будет добавлена точка (.)

source: list title
ru: заголовок списка

source: grouped list
ru: группированный список

source: groups
ru: группы

source: nowhere
ru: никуда

source: something went wrong. please try again later.
ru: что-то пошло не так. пожалуйста, попробуйте позже.

source: <0>impoexpo</0> is a <1>data transfer automation tool</1>
ru: <0>impoexpo</0> — <1>платформа автоматизации переноса данных</1>

source: impoexpo allows one to easily transfer data between unrelated services, without the need to copy & paste a million times.
ru: impoexpo позволяет переносить данные между различными сервисами, избавляя вас от необходимости нажимать "копировать и вставить" по несколько миллионов раз.

source: <0>impoexpo</0> is a <1>node-based editor</1>
ru: <0>impoexpo</0> — <1>редактор графов</1>

source: see how and where your data flows. we provide more than 50 nodes for transforming and filtering data.
ru: наглядно управляйте как и куда текут ваши данные. мы предлагаем более 50 узлов для преобразования и фильтрации данных.

source: <0>impoexpo</0> is<1> secure</1><2/><3> (we think)</3>
ru: <0>impoexpo</0><1> безопасен</1><2/><3> (мы думаем)</3>

source: we don't store personal data on our servers, instead we encrypt it and store it client-side. this should (hopefully) prevent any leakage via malicious code execution.<0/>we would love to be proven wrong, though.
ru: мы не храним ваши персональные данные на наших серверах. вместо этого, мы их шифруем и храним у вас в браузере. мы надеемся, что это предотвратит возможную утечку личных данных из-за выполнения вредоносного кода на машине пользователя.<0/>мы будем рады, если кто-нибудь докажет обратное.

source: <0>impoexpo</0> is <1>open-source</1>
ru: <0>impoexpo</0> — <1>ПО с открытым исходным кодом</1>

source: the source code for impoexpo is hosted on github and can be found <0>here</0>.
ru: код impoexpo находится на github'е и может быть найден <0>здесь</0>.

source: <0>privacy policy</0><1/><2/>impoexpo is a "services aggregator". it allows you to transfer data between different services without the need to do the tedious work manually. this means that you have to login into such services (i.e. google), usually over OAuth2, so that impoexpo can perform its function.<3/><4/>impoexpo <5>may</5> access personal information like your profile picture, email address, and integration-specific information like files on your Google Drive for the Google Forms integration.<6/><7>none</7> of this information is stored on our services, however it is encrypted on our servers and stored client-side, which (hopefully) prevents any possible attacks via malicious code executed on the user's machine.<8/><9/> the developers have no malicious intent with your data and collect as little information as possible so that impoexpo can work. if you're unsure or don't trust us, impoexpo is open-source software and it's source code can be accessed at<10>https://github.com/IT-FAMCS/impoexpo</10>.
ru: <0>политика конфиденциальности</0><1/><2/>impoexpo — "агрегатор сервисов". он позволяет переносить данные между различными сервисами без необходимости делать это вручную. это означает, что вам необходимо логиниться в эти сервисы, обычно через OAuth2, чтобы impoexpo мог выполнять свою функцию.<3/><4/>impoexpo <5>может</5> получать доступ к личным данным по типу изображения вашего профиля, адрес вашей электронной почты, и информации, специфичной к конкретной интеграции, например, доступ к вашим файлам на Google Drive для интеграции Google Forms.<6/><7>никакая</7> информация не хранится на наших серверах; она зашифрована на серверах и хранится на клиенте (вашем браузере), что (мы надеемся) минимизирует риск утечки данных от вредоносного кода, исполняемого на машине пользователя.<8/><9/> разработичики impoexpo не имеют злых побуждений и собирают как можно меньше данных, чтобы impoexpo функционировал. если вы сомневаетесь или не доверяете нам, impoexpo — ПО с открытым исходным кодом, который может быть найден по ссылке<10>https://github.com/IT-FAMCS/impoexpo</10>.

source: new data transfer
ru: новый перенос данных

source: select sources
ru: выбор источников

source: what should we transfer?
ru: что будем перемещать?

source: formatting
ru: форматирование

source: how should we transfer?
ru: как будем перемещать?

source: where the magic happens...
ru: где творится магия...
